driver-tests/httpsoapbc/SOAPHeaderTests/SynchronousSampleServiceClientApp/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:trig="http://j2ee.netbeans.org/wsdl/SynchronousSampleServiceClient/Trigger">
  <soapenv:Body>
    <trig:TriggerOperation>
      <part1>Just a hello world</part1>
    </trig:TriggerOperation>
  </soapenv:Body>
</soapenv:Envelope>